// 本个股扫描完全基于价投“称重机模型”。
// 涛哥教导：即便是赌，也不能压注在垃圾上；因为垃圾身上你不知道会发生什么
// -------------------------------------------------------------------------------------------------------------------
// v0.1 - policy A的个股扫描: 基于 1).   --- 2018.8.30

package pa

import (
        "fmt"
        )

// --------------------------估值函数 ----------------------------
func Scan(fn_viList string) (sug_1, sug_2, sug_3 string){
	fmt.Print("Info:<Scan> scanning...")
 //     sug_code := [] int{}
 //     cw_intension := int{50}
	return 

}



// ====================== 三碗面 ================================
// 基本面决定趋势，技术面决定位置，情绪面决定日常波动区间




//----------------------- 优质公司ROE-----------------------------




//---------- 使用毛利润与资产之比（Gross-Profit-to-Assets,GP/A）--------





//----------------------- 盈利能力 和 PE  -----------------------
// 盈利能力(毛利率、净利润率的高低)保证上行，PE保证价格便宜




//-------------------------是否龙头------------------------------
// 未来新增产能情况（决定未来可发展的可持续性），行业排序（决定是否是行业龙头及辅助判断坑风险能力）



//------------------------ 营收占款的占比 -----------------------
//（决定财务结构是否健康）



//------------------------ 新增业务收入情况----------------------
//（决定业务增长情况）





//-------------------------- mgt打分--------------------------




//------------------------- 员工参与度 ----------------------


//"我个人选票原则，只在沪深300+中证500这800只成分股里选"


//----------------------- 选股范围 ----------------------------
//我这几年来圈定的选股范围，一直是沪深300+中证500这800只股票，这话我说过10次不止了，从这800只股票里选标的，踩雷的概率会
//降低很多。然后我此前也说过，A股国际化后，只有成分股才会受到外资的追捧，后期大多数非指标股、成分股会逐渐被市场边缘化...




///////////////////////// JoinQuant py低估价值选股代码 //////////////////////
//1.市净率小于2；
//2.负债比例高于市场平均值;
//3.企业的流动资产至少是流动负债的1.2倍;
//4.每年四次调仓，即在1/4/7/10月调仓；
//5.可加入止损(十天HS300跌幅达10%清仓)；

