/*********************************************************
/* single stock filter
/* --------------
/*  License: BSD
/* --------------
/* v 0.1    init version - 2019.3.1
/*********************************************************/


package pa

import (
        "fmt"
       )



func SinglesFlt(ss []string)(so []string){
	fmt.Print("Start remove unwanted singles ...")
	return
}



//------------------ 次新 ------------------------------------


//----------------- 重组 --------------------
//有关重组股，我说最多的话就是：千万不要碰那些大量做过资产并购的票，全是核地雷。



//------------------------- 不碰 ----------------------------------
//然后养殖不碰、养花种草、农业类的不碰，科技软件基本不碰、环保工程的不碰，公用事业不碰，综合类企业不碰，
//频繁重组资产并购的不碰，民企基本不碰，影视娱乐传媒行业不碰，我有这些不碰原则后，然后我又只在沪深300+中证500里
//选票，这样我个人踩雷的概率已经极低。


