/*********************************************************
/* calculate top data(ti)
/* --------------
/*  License: BSD 
/* --------------
/* v 0.01    init version - 2018.8.28
/*********************************************************/


package pa

import (
        "qif"
        "fmt"
        "cmn" 
       )



/////////////////// * parameters * /////////////////////////

///// 平均 //////

const(
PE_TOP_HIST_L = 28.0;
PE_TOP_HIST_M = 35.0;               # Important
PE_TOP_HIST_H = 50.0;
)

const(
PB_TOP_HIS_M_SH =           
PB_TOP_HIS_L_SH = 
PB_TOP_HIS_H_SH = 6.8
PB_TOP_HIS_M_SZ =        
PB_TOP_HIS_L_SZ = 
PB_TOP_HIS_H_SZ =  7.2
PB_TOP_HIS_M_SME =       
PB_TOP_HIS_L_SME =
PB_TOP_HIS_H_SME = 8.1
PB_TOP_HIS_M_GEM =   
PB_TOP_HIS_L_GEM =  
PB_TOP_HIS_H_GEM = 
)

// 融资余额占流通市值比
const(
MTSR_TOP_HIST_M =           
MTSR_TOP_HIST_L =
MTSR_TOP_HIST_H = 
)

const(
VOL_TOP_HIST_L =                //
VOL_TOP_HIST_M =                 // Important
VOL_TOP_HIST_H =
)




//--- 人肉ERR ---
ERR_TAO_GE       = 0.15                // 10% - 20%. 市场好时10%误差，烂到极点时20%误差
ERR_LIN_HU_X_S   = 





//----------------------------------------------------------------------------
top = f2(pe_avg, vol_trade, index_emo, pe_50, pe_300,pe_ms, pe_gm);

//----估值函数---




func topcalc()(){        

    A.pe_sh,  A.pe_sz,  A.pe_gem   = Qif.getCurPE()
    A.vol_sh, A.vol_sz, A.vol_gem  = Qif.getCurVol()
    A.mtss,   A.mtsr               = Qif.getCurMtss()   
}

func GetSingle(code,date){

}

}

//---------------------- 成交量 --------------------------------------
//俗话说，多头不死，空头不止。一般底部来临时，绝大多数人都对市场绝望了，该斩仓出局的人大多都已经退出，剩下的是一些
//零星的卖出盘，基本没有太多人愿意买入.
//而地量形成的原因是没有人愿意卖出也没有人愿意买入，股价处于极度低迷的状态，也意味着市场缺乏增量资金，市场情绪不高。
//但另一方面也意味着空头势力衰弱，多空双方暂时达成平衡，市场底部往往伴随地量盘整。


//-----------------------  高换手率 ---------------------------------
// 换手率大于10%就要出货


//-------------------------两融余额----------------------------------

// 这样2015年度A股正式的两融业务总额最高是2.26万亿，其他杠杆资金是配资，而掐死配资业务后，很多类似我这样的赌徒都只能选择券商的两融业务
//...，然后加上这几年市场规模扩大太快，两融标的池子的两融券种也大幅提高，那么这轮行情到顶峰时，两市融资余额过3万亿，甚至是到4万亿都将是常态

//2010年3月31日才开始发展两融业务，2012、2013年股民参与两融还不是普遍性，直到2015年初牛市行情确认后，两融业务才真正快速发展，"




//----------------- 新开户数量 ----------------
//2019.3 市场高峰期时，每周开户数量可以过百万户，现在每周开户数量才30万户，说明市场还没开始疯狂，那么等这次市场每周
// 新开户数量再到150万户时，就离场


//----------------------- 股东人数 ----------------------------------
// 
//2014年9月份，券商板块异动，当季涨幅44.66%时，持股户数由65504户缩减到51527户，降低了21.33%，
//             这期间持股户数减少是因股价上涨，短线获利资金和浮筹离场所致。
//             但持股户数降低，离场人数增加并没有影响股价的趋势性上涨，
// 2014年四季度股价再度上涨117.67%后，持股户数从51527户增加到75679户，增幅46.80%，
//                    表明大量资金追高买入东吴。
// 到2015年4月和6月，持股户数增加到100676户，再度增加33%，
//                   表明大量资金在东吴到顶时高位追入








