// 背景：
// 目前市场上有4种策略：1)价值投资策略；2)量化分析策略；3)技术分析策略； 4)行为金融策略 
// 3)本质是讲究概率经验；基本认为是无效策略，被2）鄙视为“占星术”，
// 但是4)+3)是市场上“高人”们在用； 
// 2)目前基本还不挣钱原因是”没有方程“或者说没有正确的方程；等待数理分析突破的一天。
// 本策略B:
//       基于符号运算，也就是2)。
// -------------------------------------------------------------------------------------------------------------------
// v0.01 - policy B: 关键要有可靠的模型. 模型是？  --- 2018.8.30
// chaos ? t.? # 特色：非线性，记忆， ?# 手段： BP， BRF，分形分维

package pb


import (
        "fmt"
        ""     // model based index & position 
        ""
        )



